wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/Device/Nuvoton/M5531/Source/startup_M5531.c
void NPU_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void OTFC0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void PDMA0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void PDMA1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void PMC_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void PSIO_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void QSPI0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void QSPI1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void RTC_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void RTCTAMPER_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));

void SC0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SC1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SC2_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
#if defined (__ARM_FEATURE_CMSE) &&  (__ARM_FEATURE_CMSE == 3U)
    void SCU_IRQHandler(void);
#else
    void SCU_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
#endif
void SDH0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SDH1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SPI0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SPI1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SPI2_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SPI3_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SPIM0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void SRAMPERR_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TIMER0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TIMER1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TIMER2_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TIMER3_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TRNG_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TTMR0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void TTMR1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART2_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART3_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART4_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART5_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART6_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART7_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART8_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UART9_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void USBD_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void USBH0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void USBH1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void USBOTG_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void USCI0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void UTCPD_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void WDT0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void WDT1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void WWDT0_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));
void WWDT1_IRQHandler(void) __attribute__((weak, alias("Default_Handler")));

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/
#if defined ( __GNUC__ )
    #pragma GCC diagnostic push
    #pragma GCC diagnostic ignored "-Wpedantic"
#endif

/* Static vector table
 * For better performance, M55M1 places the vector table in DTCM by default.
 * Users can define NVT_VECTOR_ON_FLASH to place the vector table in Flash.
 *
 * In IAR:
 *   All IRQ handlers referenced in __VECTOR_TABLE (__vector_table) must be placed in Flash.
 *   Becuase IRQ handlers referenced in __VECTOR_TABLE are protected by IAR linker and
 *   will not affected by 'initialize by copy'.
 *
 * If NVT_VECTOR_ON_FLASH is not defined,
 * the vector table __VECTOR_TABLE is valid until VTOR is switched to DTCM_VECTOR_TABLE in SystemInit().
 */
const VECTOR_TABLE_Type __VECTOR_TABLE[] __VECTOR_TABLE_ATTRIBUTE =
#ifndef NVT_VECTOR_ON_FLASH
{
    (VECTOR_TABLE_Type)(&__INITIAL_SP),       /*       Initial Stack Pointer                            */
    Reset_Handler,                            /*       Reset Handler                                    */
    NMI_Handler,                              /*   -14 NMI Handler                                      */
    HardFault_Handler,                        /*   -13 Hard Fault Handler                               */
    MemManage_Handler,                        /*   -12 MPU Fault Handler                                */
    BusFault_Handler,                         /*   -11 Bus Fault Handler                                */
    UsageFault_Handler,                       /*   -10 Usage Fault Handler                              */
    SecureFault_Handler,                      /*    -9 Secure Fault Handler                             */
    0,                                        /*       Reserved                                         */
    0,                                        /*       Reserved                                         */
    0,                                        /*       Reserved                                         */
    SVC_Handler,                              /*    -5 SVC Handler                                      */
    DebugMon_Handler,                         /*    -4 Debug Monitor Handler                            */
    0,                                        /*       Reserved                                         */
    PendSV_Handler,                           /*    -2 PendSV Handler Handler                           */
    Default_Handler,                          /*    -1 SysTick Handler                                  */
};

/* Declare new vector table placed in DTCM */
const VECTOR_TABLE_Type DTCM_VECTOR_TABLE[] NVT_DTCM_VTOR =
#endif
{
    (VECTOR_TABLE_Type)(&__INITIAL_SP),       /*       Initial Stack Pointer                            */
    Reset_Handler,                            /*       Reset Handler                                    */
    NMI_Handler,                              /*   -14 NMI Handler                                      */
    HardFault_Handler,                        /*   -13 Hard Fault Handler                               */
    MemManage_Handler,                        /*   -12 MPU Fault Handler                                */
    BusFault_Handler,                         /*   -11 Bus Fault Handler                                */
    UsageFault_Handler,                       /*   -10 Usage Fault Handler                              */
    SecureFault_Handler,                      /*    -9 Secure Fault Handler                             */
    0,                                        /*       Reserved                                         */
    0,                                        /*       Reserved                                         */
    0,                                        /*       Reserved                                         */
    SVC_Handler,                              /*    -5 SVC Handler                                      */
    DebugMon_Handler,                         /*    -4 Debug Monitor Handler                            */
    0,                                        /*       Reserved                                         */
    PendSV_Handler,                           /*    -2 PendSV Handler Handler                           */
    SysTick_Handler,                          /*    -1 SysTick Handler                                  */

    /* Interrupts */
    BODOUT_IRQHandler,                        /*!<   0 Brown-Out Low Voltage Detected Interrupt Handler */
    IRC_IRQHandler,                           /*!<   1 IRC TRIM Interrupt Handler                       */
    PMC_IRQHandler,                           /*!<   2 Power Mode Controller Interrupt Handler          */
    SRAMPERR_IRQHandler,                      /*!<   3 SRAM Parity Check Error Interrupt Handler        */
    CKFAIL_IRQHandler,                        /*!<   4 Clock Fail Detected Interrupt Handler            */
    ISP_IRQHandler,                           /*!<   5 FMC ISP Interrupt Handler                        */
    RTC_IRQHandler,                           /*!<   6 Real Time Clock Interrupt Handler                */
    RTCTAMPER_IRQHandler,                     /*!<   7 Backup Register Tamper Interrupt Handler         */
    WDT0_IRQHandler,                          /*!<   8 Watchdog Timer 0 Interrupt Handler               */
    WWDT0_IRQHandler,                         /*!<   9 Window Watchdog Timer 0 Interrupt Handler        */

