wosayttn/sdk-bsp-numaker-m55m1/libraries/m5531/Device/Nuvoton/M5531/Source/startup_M5531.c
    UTCPD_IRQHandler,                         /*!< 150 UTCPD Interrupt Handler                          */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */
    0,                                        /*!<     Reserved                                         */

    GDMACH0_IRQHandler,                       /*!< 160 GDMA Channel 0 Interrupt Handler                 */
    GDMACH1_IRQHandler,                       /*!< 161 GDMA Channel 1 Interrupt Handler                 */
};

#if defined ( __GNUC__ )
    #pragma GCC diagnostic pop
#endif

/* If some peripherals (e.g. Hyper RAM) must be initialized before startup routine
 *   user can implement its own Reset_Handler_PreInit to do early initialization.
 *
 * All code in Reset_Handler_PreInit must have the same load address and execution address;
 * otherwise, users need to provide their own implementation of Reset_Handler_PreInit.
 */
__WEAK void Reset_Handler_PreInit(void)
{
    /* Prevent using C runtime library functions (e.g. printf)
     * or global variables in this function.
     */
#ifndef NVT_CMSE_NON_SECURE

    /* Clock Setting is only available in secure mode */
    /* Enable the default APLL0 frequency and switch the SCLK clock source to APLL0. */
    CLK_SetBusClock(CLK_SCLKSEL_SCLKSEL_APLL0, CLK_APLLCTL_APLLSRC_HIRC, __HSI);

    /* Update System Core Clock */
    SystemCoreClockUpdate();
#endif
}

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler(void)
{
    /* Copy __set_PSP/__set_MSPLIM/__set_PSPLIM from cmsis_armclang.h */
    __ASM volatile("MSR psp, %0" : : "r"((uint32_t)(&__INITIAL_SP)) :);
    __ASM volatile("MSR msplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));
    __ASM volatile("MSR psplim, %0" : : "r"((uint32_t)(&__STACK_LIMIT)));

    /* Enable SRAM1/2 functions are only available in secure mode */
    if (SCU_IS_CPU_NS(SCU_NS) == 0)
    {
        /* Unlock protected registers */
        SYS_UnlockReg();

        PMC_SetSRAMPowerMode(PMC_SYSRB0PC_SRAM0PMS_Msk |
                             PMC_SYSRB0PC_SRAM1PMS_Msk |
                             PMC_SYSRB0PC_SRAM2PMS_Msk |
                             PMC_SYSRB0PC_SRAM3PMS_Msk |
                             PMC_SYSRB0PC_SRAM4PMS_Msk |
                             PMC_SYSRB0PC_SRAM5PMS_Msk |
                             PMC_SYSRB0PC_SRAM6PMS_Msk |
                             PMC_SYSRB0PC_SRAM7PMS_Msk
                             , PMC_SYSRB0PC_SRAM_NORMAL);
        PMC_SetSRAMPowerMode(PMC_SYSRB1PC_SRAM0PMS_Msk |
                             PMC_SYSRB1PC_SRAM1PMS_Msk |
                             PMC_SYSRB1PC_SRAM2PMS_Msk |
                             PMC_SYSRB1PC_SRAM3PMS_Msk |
                             PMC_SYSRB1PC_SRAM4PMS_Msk |
                             PMC_SYSRB1PC_SRAM5PMS_Msk |
                             PMC_SYSRB1PC_SRAM6PMS_Msk |
                             PMC_SYSRB1PC_SRAM7PMS_Msk
                             , PMC_SYSRB1PC_SRAM_NORMAL);
        PMC_SetSRAMPowerMode(PMC_SYSRB2PC_SRAM0PMS_Msk |
                             PMC_SYSRB2PC_SRAM1PMS_Msk |
                             PMC_SYSRB2PC_SRAM2PMS_Msk |
                             PMC_SYSRB2PC_SRAM3PMS_Msk |
                             PMC_SYSRB2PC_SRAM4PMS_Msk
                             , PMC_SYSRB2PC_SRAM_NORMAL);
        PMC_SetSRAMPowerMode(PMC_SYSRB3PC_SRAM0PMS_Msk
                             , PMC_SYSRB3PC_SRAM_NORMAL);
        PMC_SetSRAMPowerMode(PMC_LPSYSRPC_SRAM0PMS_Msk
                             , PMC_LPSYSRPC_SRAM_NORMAL);

        // Enable SRAM0/1/2/3 clock
        CLK->SRAMCTL |= (CLK_SRAMCTL_SRAM0CKEN_Msk | CLK_SRAMCTL_SRAM1CKEN_Msk | CLK_SRAMCTL_SRAM2CKEN_Msk | CLK_SRAMCTL_SRAM3CKEN_Msk);

        // Enable LPSRAM0 clock
        CLK->LPSRAMCTL |= (CLK_LPSRAMCTL_LPSRAM0CKEN_Msk);
    }

    /* To assign __HIRC value directly before BSS initialization. */
    SystemCoreClock = __HIRC;

#if (defined (__FPU_USED) && (__FPU_USED == 1U)) || \
    (defined (__ARM_FEATURE_MVE) && (__ARM_FEATURE_MVE > 0U))
    SCB->CPACR |= ((3U << 10U * 2U) |         /* Enable CP10 Full Access */
                   (3U << 11U * 2U));         /* Enable CP11 Full Access */

    /* Set low-power state for PDEPU                */
    /*  0b00  | ON, PDEPU is not in low-power state */
    /*  0b01  | ON, but the clock is off            */
    /*  0b10  | RET(ention)                         */
    /*  0b11  | OFF                                 */

    /* Clear ELPSTATE, value is 0b11 on Cold reset */
    PWRMODCTL->CPDLPSTATE &= ~(PWRMODCTL_CPDLPSTATE_ELPSTATE_Msk << PWRMODCTL_CPDLPSTATE_ELPSTATE_Pos);

    /* Favor best FP/MVE performance by default, avoid EPU switch-ON delays */
    /* PDEPU ON, Clock OFF */
    PWRMODCTL->CPDLPSTATE |= 0x1 << PWRMODCTL_CPDLPSTATE_ELPSTATE_Pos;
#endif

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
    __TZ_set_STACKSEAL_S((uint32_t *)(&__STACK_SEAL));
#endif

    SCB_InvalidateICache();
    SCB_EnableICache();

#if (NVT_DCACHE_ON == 1)
    SCB_InvalidateDCache();
    SCB_EnableDCache();
#endif  // (NVT_DCACHE_ON == 1)

    SystemInit();

    Reset_Handler_PreInit();
    /* All global variables will be initialized by __PROGRAM_START,
     * therefore any global variables assignment will be overwritten after __PROGRAM_START.
     */
    __PROGRAM_START();      // Enter PreMain (C library entry point)
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
    #pragma clang diagnostic ignored "-Wmissing-noreturn"
#endif


/*----------------------------------------------------------------------------
  Hard Fault Handler
 *----------------------------------------------------------------------------*/
extern void ProcessHardFault(uint32_t *pu32StackFrame);

struct StackFrame
{
    uint32_t r0;
    uint32_t r1;
    uint32_t r2;
    uint32_t r3;
    uint32_t r12;
    uint32_t lr;
    uint32_t pc;
    uint32_t xPsr;
};

/*----------------------------------------------------------------------------
  Default Handler for Exceptions / Interrupts
 *----------------------------------------------------------------------------*/
void Default_Handler(void)
{
    while (1);
}

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
#endif
